Repository: uabogdev2/points-app
Catalog: lib/l10n/app_*.arb
Languages: fr

# appSubtitle
source: The ultimate strategy game
fr: Le jeu de stratégie ultime

source: Welcome,
fr: Bienvenue,

source: Player
fr: Joueur

source: Continue with Google
fr: Continuer avec Google

source: Continue with Apple
fr: Continuer avec Apple

# connectToSave
source: 📝 Sign in to save your scores and challenge your friends!
fr: 📝 Connectez-vous pour sauvegarder vos scores et défier vos amis !

# acceptTerms
source: By continuing, you agree to our {terms} and our {privacy}
fr: En continuant, vous acceptez nos {terms} et notre {privacy}

source: terms
fr: conditions

# privacy
source: privacy policy
fr: politique de confidentialité

source: Error
fr: Erreur

source: Retry
fr: Réessayer

source: Cancel
fr: Annuler

source: Confirm
fr: Confirmer

source: Back
fr: Retour

source: Home
fr: Accueil

source: Leaderboard
fr: Classement

source: Settings
fr: Paramètres

source: Help
fr: Aide

# quitApp
source: Quit the application?
fr: Quitter l'application ?

# quitAppConfirm
source: Are you sure you want to quit Points Master?
fr: Êtes-vous sûr de vouloir quitter Points Master ?

source: Quit
fr: Quitter

source: Game Modes
fr: Modes de jeu

# chooseAdventure
source: Choose your adventure
fr: Choisissez votre aventure

# soloSubtitle
source: Challenge artificial intelligence
fr: Défiez l'intelligence artificielle

# duoSubtitle
source: 2 players on the same screen
fr: 2 joueurs sur le même écran

source: Quick Match
fr: Partie Rapide

# quickMatchSubtitle
source: Find an opponent online
fr: Trouvez un adversaire en ligne

source: Private Game
fr: Partie Privée

# privateGameSubtitle
source: Create a room with QR code
fr: Créez une salle avec code QR

source: Others
fr: Autres

source: Help and settings
fr: Aide et paramètres

source: Victories
fr: Victoires

source: Streak
fr: Série

source: Profile
fr: Profil

source: Edit profile
fr: Modifier le profil

# editProfileSubtitle
source: Change your name and avatar
fr: Changez votre nom et votre avatar

# editProfileLimited
source: Limited to once per week
fr: Modification limitée à 1 fois par semaine

# profileUpdateLimit
source: You can edit your profile once per week. Please try again later.
fr: Vous pouvez modifier votre profil une fois par semaine. Veuillez réessayer plus tard.

source: Push notifications
fr: Notifications push

# pushNotificationsSubtitle
source: Receive notifications
fr: Recevoir des notifications

source: Background music
fr: Musique de fond

# backgroundMusicSubtitle
source: Enable background music
fr: Activer la musique de fond

source: Game sounds
fr: Sons de jeu

# gameSoundsSubtitle
source: Enable sounds (click, success)
fr: Activer les sons (clic, succès)

source: Language
fr: Langue

# languageSubtitle
source: Choose the application language
fr: Choisir la langue de l'application

source: French
fr: Français

source: English
fr: Anglais

# systemDefault
source: Default (system)
fr: Par défaut (système)

source: Sign out
fr: Se déconnecter

# signOutConfirm
source: Sign out
fr: Déconnexion

# signOutMessage
source: Are you sure you want to sign out?
fr: Êtes-vous sûr de vouloir vous déconnecter ?

# signOutError
source: Error signing out: {error}
fr: Erreur lors de la déconnexion: {error}

source: Loading...
fr: Chargement...

source: Loading game...
fr: Chargement de la partie...

source: Loading stats...
fr: Chargement des stats...

source: Loading leaderboard...
fr: Chargement du classement...

# connectionInProgress
source: Connecting...
fr: Connexion en cours...

source: Game not found
fr: Partie introuvable

source: Forfeit?
fr: Abandonner ?

# forfeitMessage
source: Your opponent will automatically win.
fr: Votre adversaire gagnera automatiquement.

# forfeitAction
source: Forfeit
fr: Abandonner

source: Waiting...
fr: En attente...

# waitingOpponent
source: An opponent will join soon
fr: Un adversaire va bientôt rejoindre

source: Online game
fr: Partie en ligne

# gameNumber
source: Game #{gameId}
fr: Partie #{gameId}

source: Your turn!
fr: À vous de jouer !

# opponentTurn
source: Opponent's turn
fr: Tour de l'adversaire

source: Player 1
fr: Joueur 1

source: Player 2
fr: Joueur 2

source: you
fr: vous

source: squares
fr: carrés

source: Victory!
fr: Victoire !

source: Defeat
fr: Défaite

source: Draw!
fr: Match nul !

source: Winner
fr: Vainqueur

source: Back to home
fr: Retour à l'accueil

source: Update required
fr: Mise à jour requise

source: Update available
fr: Mise à jour disponible

# currentVersion
source: Current version: {version}
fr: Version actuelle: {version}

# latestVersion
source: Latest version: {version}
fr: Dernière version: {version}

# updateLater
source: Later
fr: Plus tard

source: Update
fr: Mettre à jour

# updateRequiredMessage
source: The update is required to continue.
fr: La mise à jour est requise pour continuer.

# updateError
source: Unable to open the link. Please update manually from the store.
fr: Impossible d'ouvrir le lien. Veuillez mettre à jour manuellement depuis le store.

# updateUrlError
source: Update URL not available. Please update from the store.
fr: URL de mise à jour non disponible. Veuillez mettre à jour depuis le store.

source: Grid size
fr: Taille de la grille

source: Difficulty
fr: Difficulté

# chooseDifficulty
source: Choose your challenge level
fr: Choisissez votre niveau de défi

source: Beginner
fr: Débutant

# beginnerSubtitle
source: Perfect for learning the rules
fr: Parfait pour apprendre les règles

# normalSubtitle
source: A balanced challenge
fr: Un défi équilibré

# expertSubtitle
source: For true strategists
fr: Pour les vrais stratèges

# gridSizeSubtitle
source: The larger the grid, the more strategic
fr: Plus la grille est grande, plus c'est stratégique

# quickGame
source: Quick game • ~2 min
fr: Partie rapide • ~2 min

# classicGame
source: Classic • ~5 min
fr: Classique • ~5 min

# strategicGame
source: Strategic • ~10 min
fr: Stratégique • ~10 min

# createGame
source: Create a game
fr: Créer une partie

# createGameSubtitle
source: Generate a code and QR code
fr: Générer un code et un QR code

# joinGame
source: Join a game
fr: Rejoindre une partie

# joinGameSubtitle
source: Scan a QR code or enter a code
fr: Scanner un QR code ou entrer un code

# duoInfo
source: Play together on the same screen! Pass the phone to your opponent.
fr: Jouez à deux sur le même écran ! Passez le téléphone à votre adversaire.

# privateGameInfo
source: Create a private game and share the QR code with your friend!
fr: Créez une partie privée et partagez le code QR avec votre ami !

# createOrJoin
source: Create or join a game
fr: Créer ou rejoindre une partie

source: Statistics
fr: Statistiques

source: Your performance
fr: Vos performances

source: No statistics
fr: Aucune statistique

# playToUnlock
source: Play to unlock your stats!
fr: Jouez pour débloquer vos stats !

source: Overview
fr: Vue d'ensemble

source: Games
fr: Parties

source: Win rate
fr: Taux de victoire

source: Rate
fr: Taux

# matchmaking
source: Quick Match
fr: Partie Rapide

source: For ranking
fr: Pour le classement

# playMatchmaking
source: Play in "Quick Match" mode to appear in the leaderboard
fr: Jouez en mode "Partie Rapide" pour apparaître dans le classement

source: Defeats
fr: Défaites

source: Best score
fr: Meilleur score

source: Squares completed
fr: Carrés complétés

source: Current streak
fr: Série actuelle

source: Longest streak
fr: Meilleure série

source: Details
fr: Détails

source: Top Players
fr: Top Joueurs

# bestOfTheMoment
source: The best of the moment
fr: Les meilleurs du moment

# joinRanking
source: Join the leaderboard and become the Points Master!
fr: Rejoignez le classement et devenez le Points Master !

# noLeaderboard
source: No leaderboard available
fr: Aucun classement disponible

# playToAppear
source: Play in "Quick Match" mode to appear in the leaderboard!
fr: Jouez en mode "Partie Rapide" pour apparaître dans le classement !

source: How to play
fr: Comment jouer

# gameGuide
source: Points Master game guide
fr: Guide du jeu Points Master

source: Game rules
fr: Règles du jeu

# rule1
source: 1. Connect two points
fr: 1. Connectez deux points

# rule1Desc
source: Click on a point, then on another adjacent point to create a segment.
fr: Cliquez sur un point, puis sur un autre point adjacent pour créer un segment.

# rule2
source: 2. Complete squares
fr: 2. Complétez des carrés

# rule2Desc
source: When you complete the 4 sides of a square, you score a point.
fr: Lorsque vous complétez les 4 côtés d'un carré, vous marquez un point.

# rule3
source: 3. Score points
fr: 3. Gagnez des points

# rule3Desc
source: The player with the most points at the end of the game wins.
fr: Le joueur avec le plus de points à la fin de la partie gagne.

# rule4
source: 4. Strategy
fr: 4. Stratégie

# rule4Desc
source: Try to complete multiple squares in a single move to maximize your points.
fr: Essayez de compléter plusieurs carrés en un seul coup pour maximiser vos points.

# gameModesSection
source: Game modes
fr: Modes de jeu

# soloModeDesc
source: Play against artificial intelligence. Perfect for training.
fr: Jouez contre l'intelligence artificielle. Parfait pour s'entraîner.

# duoModeDesc
source: Play together on the same screen. Ideal for playing with a friend.
fr: Jouez à deux sur le même écran. Idéal pour jouer avec un ami.

# quickMatchMode
source: Quick Match
fr: Partie Rapide

# quickMatchModeDesc
source: Find an opponent online and play in real time.
fr: Trouvez un adversaire en ligne et jouez en temps réel.

# privateGameMode
source: Private Game
fr: Partie Privée

# privateGameModeDesc
source: Create a room with a QR code and invite your friends.
fr: Créez une salle avec un code QR et invitez vos amis.

source: Tips and tricks
fr: Conseils et astuces

# tip1
source: Block your opponent
fr: Bloquez votre adversaire

# tip1Desc
source: Prevent your opponent from completing squares by blocking their moves.
fr: Empêchez votre adversaire de compléter des carrés en bloquant ses mouvements.

# tip2
source: Plan your moves
fr: Planifiez vos coups

# tip2Desc
source: Look several moves ahead to maximize your opportunities.
fr: Regardez plusieurs coups à l'avance pour maximiser vos opportunités.

# tip3
source: Manage your time
fr: Gérez votre temps

# tip3Desc
source: You have limited time per turn. Use it wisely.
fr: Vous avez un temps limité par tour. Utilisez-le à bon escient.

# tip4
source: Observe the board
fr: Observez le plateau

# tip4Desc
source: Identify nearly completed squares to gain an advantage.
fr: Identifiez les carrés presque complétés pour prendre l'avantage.

# faq
source: Frequently asked questions
fr: Questions fréquentes

# faq1
source: What happens in case of a tie?
fr: Que se passe-t-il en cas d'égalité ?

# faq1Desc
source: In case of a tie, the player who completed the last square wins.
fr: En cas d'égalité, le joueur qui a complété le dernier carré gagne.

# faq2
source: Can I undo a move?
fr: Puis-je annuler un coup ?

# faq2Desc
source: No, moves are final. Think carefully before playing!
fr: Non, les coups sont définitifs. Réfléchissez bien avant de jouer !

# faq3
source: What if I lose connection?
fr: Que faire si je perds la connexion ?

# faq3Desc
source: You have a few seconds to reconnect. Otherwise, the game is lost.
fr: Vous avez quelques secondes pour vous reconnecter. Sinon, la partie est perdue.

# faq4
source: How does ranking work?
fr: Comment fonctionne le classement ?

# faq4Desc
source: Your wins and losses affect your ranking. The more you win, the higher you climb!
fr: Vos victoires et défaites influencent votre classement. Plus vous gagnez, plus vous montez !

# personalizeExperience
source: Personalize your experience
fr: Personnalisez votre expérience

# guide
source: Game guide
fr: Guide du jeu

source: Under development
fr: En développement

# editProfileTitle
source: Edit profile
fr: Modifier le profil

source: Profile photo
fr: Photo de profil

source: Name
fr: Nom

# nameRequired
source: Name is required
fr: Le nom est requis

# nameValidation
source: Max 9 characters, letters and numbers only
fr: Max 9 caractères, lettres et chiffres uniquement

# nameValidationError
source: Name must contain between 1 and 9 characters (letters and numbers only)
fr: Le nom doit contenir entre 1 et 9 caractères (lettres et chiffres uniquement)

# imageSelectionError
source: Error selecting image: {error}
fr: Erreur lors de la sélection de l'image: {error}

# profileUpdatedSuccess
source: Profile updated successfully
fr: Profil mis à jour avec succès

source: Save
fr: Sauvegarder

# deleteMyData
source: Manage my account
fr: Supprimer mes données

# deleteMyDataMessage
source: You will continue on an external browser
fr: Vous allez poursuivre sur un navigateur externe

source: Yes
fr: Oui

source: Close
fr: Fermer

source: Cannot open URL
fr: Impossible d'ouvrir l'URL

# noMappingFileWarning
source: No deobfuscation file is associated with this App Bundle. If you use obfuscated code (R8/ProGuard), importing a deobfuscation file will simplify crash and ANR analysis and debugging. You can reduce app size with R8/ProGuard.
fr: Aucun fichier de désobscurcissement n'est associé à cet App Bundle. Si vous utilisez du code obscurci (R8/ProGuard), le fait d'importer un fichier de désobscurcissement simplifiera l'analyse et le débogage des plantages et des ANR. Vous pouvez réduire la taille de l'appli avec R8/ProGuard.
